""" Практика в уроке """
a = 2
b = 0.5
c = a+b
print(c)




hi = 'привет,'.capitalize()
name = input('Как Вас зовут: ').capitalize()
c = '!'

d = f'{hi} {name}{c}'
print(d) 


""" Практические задания """

""" Задание 1 """
v = int(input('Введите число от 1 до 10: '))
print (v+10)

""" Задание 2 """
name = input('Введите Ваше имя: ')
print(f'Привет, {name}! Как дела?')

""" Задание 3,  """ ### подозреваю что я его не правильно понял

a = 1
b = 2.5
c = 1
d = ''
e = 0


print(float(a))
print(int(b))
print(bool(c))
print(bool(d))
print(bool(0))

